<?php
/**
 * Exception.php.
 *
 * Part of Tianyong90\LuckSDK.
 *
 * For the full copyright and license information, please view the LICENSE
 * file that was distributed with this source code.
 *
 * @author    tianyong90 <412039588@qq.com>
 * @copyright 2016 tianyong90 <412039588@qq.com>
 *
 * @link      https://github.com/tianyong90
 */
namespace Tianyong90\LuckSDK;

use Exception as BaseException;

class Exception extends BaseException
{
    protected $errors = array(
        '00' => '操作成功',

        //本地错误代码
        '50001' => 'token参数为空',
        '50002' => '未配置接口URL',
        '50003' => '未配置接口密钥',
        '50004' => '对接企业版，未配置企业代码',
        '50005' => '对接商盟旗舰版，未配置店铺号',
        '50006' => '请求接口数据失败',

        //通用数据
        '01' => '无效企业',
        '02' => '无效操作员',
        '03' => '操作失败，密码错误',
        '04' => '企业总店不存在',
        '05' => '操作员所在分店不存在',
        '06' => '会员或推荐人数据不存在',
        '07' => '会员密码错误',
        '08' => '会员等级数据异常',
        '09' => '会员卡已挂失或锁定',
        '10' => '会员卡已被锁定，请联系商家',
        '11' => '会员卡已被挂失，请联系商家',
        '12' => '会员卡已过期，请联系商家',
        '13' => 'KEY错误',
        '14' => 'int或decimal格式错误',
        '16' => '分店信息不存在',
        '17' => 'token不匹配',
        '18' => '操作被拒绝',

        //会员管理
        '20' => '会员卡和手机号为空，二者必填一项',
        '21' => '会员卡号重复',
        '22' => '会员手机号重复',
        '23' => '手机号格式错误',
        '24' => '生日数据错误',
        '25' => '日期数据错误',
        '26' => '会员状态与调整状态一致',
        '27' => '无效会员状态',
        '28' => '会员永不过期',
        '29' => '无效日期',
        '30' => '无效增减类型',
        '31' => '非积分卡',
        '32' => '无效变动积分',
        '33' => '微信号重复',
        '34' => '推荐人卡号不存在',

        //消费充值
        '40' => '无效交易金额',
        '41' => '交易金额必须大于0',
        '42' => '无效支付金额',
        '43' => '支付金额必须大于0',
        '44' => '无效支付方式',
        '45' => '此卡不支持积分支付',
        '46' => '此卡不支持余额支付',
        '47' => '会员余额不足',
        '48' => '会员积分不足',
        '49' => '商家不支持积分支付',
        '50' => '此卡不支持会员充值',
        '51' => '产品/礼品库存不足',
        '52' => '店铺积分不足，无法正常消费',
        '53' => '产吕不存在',
        '54' => '产品库存不足',
        '55' => '购买端口详情数据错误',
        '56' => '订单不存在或获取失败',
        '57' => '价格计算错误',

        //参数应答码
        '70' => '企业号为空',
        '71' => '操作员号为空',
        '72' => '操作员密码为空',
        '73' => '会员卡号或手机号为空',
        '74' => '会员密码为空',
        '75' => '新会员密码为空',
        '76' => '会员卡状态参数为空',
        '77' => '会员新过期时间为空',
        '78' => '调整积分参数为空',
        '79' => '调整积分类型参数为空',
        '80' => '交易金额为空',
        '81' => '实际支付金额为空',
        '82' => '余额支付金额为空',
        '83' => '现金支付金额为空',
        '84' => '银行卡支付金额为空',
        '85' => '积分支付金额为空',
        '86' => '支付方式为空',
        '87' => '充值金额金额为空',
        '88' => '微信号为空',
        '89' => '礼品ID为空',

        //POS机相关应答码
        '94' => '企业未获取授权',
        '95' => '无效操作，方法名未定义',
        '96' => '无效操作，处理码未定义',
        '97' => '无效操作，消息类型错误',
        '98' => '操作失败，MAC校验码失败',
        '99' => '操作失败，请联系商家',

        '110' => '商品ID为空',
        '111' => 'token为空',
        '112' => '礼品兑换数量为空',
        '113' => '收件人姓名为空',
        '114' => '收件人联系方式为空',
        '115' => '收件地址为空',
        '116' => '记录ID为空',
        '117' => '订单编号为空',
        '118' => '产品编号为空',
        '119' => '购买商品详情为空',
    );

    /**
     * @see \Exception::__construct
     *
     * @param string $message
     * @param int    $code
     */
    public function __construct($message, $code = null)
    {
        $message = $this->errors[$code] ?: $message;

        $message = "[LuckSDK]:{$message}";

        parent::__construct($message, $code);
    }
}
